---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireMaterialType)
source: html/d613133e-a73b-01c5-9d22-06a7159e1a54.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Erase Method

Removes a specified wire material type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	WireMaterialType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireMaterialType`) - The wire material type to be erased.

## Returns
The number of wire material types that were erased from the set.